{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [5, 5], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "dtype": "float32", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "batch_input_shape": [null, 20, 20, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "filters": 20, "activity_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "filters": 50, "activity_regularizer": null, "activation": "relu", "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 500, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "activation": "sigmoid"}}]}