{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 20, 10, 1], "kernel_size": [5, 5], "name": "conv2d_1", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "same", "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "filters": 128, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "units": 500, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "units": 250, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "units": 5, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0"}